{
    "posts": {},
    "post_ids": [
        "67dab491ba1148b12347fe8f",
        "67dab491ba1148b12347fe8d",
        "67dab6a5286e0acb2a239ce9",
        "67dabcb2286e0acb2a239cf4",
        "67dabcb4286e0acb2a239cf9",
        "67dabcb5286e0acb2a239cfb",
        "67dac0b4d34da33cddfa38f7",
        "67dac0b4d34da33cddfa38f3",
        "67dac0b4d34da33cddfa38f5",
        "67dac31529c3e340bfd4cd15",
        "67dac31529c3e340bfd4cd19",
        "67dac31529c3e340bfd4cd17",
        "67daddd8b8e94c2cf9f70d2d",
        "67daddd8b8e94c2cf9f70d2f",
        "67dae066b8e94c2cf9f70d3d",
        "67dae066b8e94c2cf9f70d3f",
        "67dc3af70d65ad88c3064c4f",
        "67dbd9706101f8917561afe3",
        "67dbd970ea6adde2628ff3be",
        "67dd02cd3a51d109b5a643af",
        "67dd02cd39e723a05d40b753",
        "67dbd9744f045bdcd6e37fd1",
        "67dbd9968ae293bb5e80f254",
        "67dbd99655c260ddca99d0e0",
        "67dbd9956c4aa486b2b9e621",
        "67dbd996314e888a60b2d816",
        "67dbd9962c8ec8532552e075",
        "67dbd9965293a8fc41479fd7",
        "67dbd996427a93a549d4e58f",
        "67dd040d244f9fe53a7cb588",
        "67dd040eb42d908e4f62e30d",
        "67dd04122fbc3bdab4b29f3d",
        "67dd041260be77dd75c84241",
        "67dd0412110a59a27c863cb4",
        "67dd0412da02daf2a9766743",
        "67dd041227525918a6003c35",
        "67dd041219744d8680476bc0",
        "67dd04123ef8eb196e327a97",
        "67dd0412a60afe7e4a98483f"
    ],
    "topk_ids": [
        "67dd040d244f9fe53a7cb588",
        "67dae066b8e94c2cf9f70d3f",
        "67dd041260be77dd75c84241",
        "67dd040eb42d908e4f62e30d",
        "67daddd8b8e94c2cf9f70d2d"
    ],
    "results": [
        {
            "_id": "67daddd8b8e94c2cf9f70d2d",
            "postTitle": "Disrespectful, low effort date plans",
            "description": "The other previous “low effort” dates I suggested were: \n- drinks at a bar\n- dinner res at a fairly nice, trendy restaurant \n- beach picnic\n\n",
            "postUrl": "https://i.redd.it/0z2ddx99yjpe1.jpeg",
            "imageUrl": "https://b.thumbs.redditmedia.com/T20WhXPhKRbLQ6af3A047KLQ74py3E_vtnBfXDYnLYE.jpg",
            "platform": "reddit",
            "processed": true,
            "category": "Entertainment & Pop Culture",
            "refinedDescription": "Refined Description:\n\nPost Title: Disrespectful, Low-Effort Date Plans\nTopic Categories: Dating, Relationships, Social Interactions, Low-Effort Dates\n\nKey Entities:\n- Location: Holmby Park\n- Activities: Picnic, Dinner, Drinks at a Bar, Beach Picnic\n- Objects: Blanket, Sandwiches\n\nPost Description:\nA person shared their previous low-effort date suggestions, including:\n- Having drinks at a bar\n- Dinner at a trendy restaurant\n- A beach picnic\n\nThey then shared a text message exchange, showcasing a conversation about planning a picnic date at Holmby Park. The person invited someone to a picnic, offering to bring a blanket and sandwiches. However, the invitee criticized the date idea, calling it \"low effort\" and \"disrespectful.\" The invitee also inquired about the person's employment status, to which they responded that they have a job with a Monday-to-Friday schedule. The conversation ended with the invitee asking not to be contacted again, and the person agreeing that they are not a good fit.\n\nImage Content:\nThe image is a screenshot of a text message conversation, detailing the exchange between two individuals about a picnic date. The conversation includes:\n1. An invitation to a picnic at Holmby Park\n2. A question about employment status\n3. A critical response to the date idea, labeling it as \"low effort\" and \"disrespectful\"\n4. A conclusion that the two individuals are not a good match\n\nEmotions and Tone:\nThe conversation conveys a sense of disappointment, criticism, and sarcasm, particularly from the invitee. The tone is primarily negative, with the invitee expressing dissatisfaction with the date idea and the person's perceived lack of effort.\n\nThis refined description structures the information to facilitate semantic search, highlighting key topics, entities, and concepts while preserving the original context and intent of the post.",
            "createdAt": "2025-03-19 15:08:08.566000",
            "updatedAt": "2025-03-19 15:08:08.566000",
            "__v": 0
        },
        {
            "_id": "67dd040d244f9fe53a7cb588",
            "postTitle": "Waqar Baig",
            "description": "Thailand Government Scholarships 2025 for Bachelors, Masters and PhD in Thai Universities I am sharing a comprehensive list of scholarships offered by the Thai Government at various universities across Thailand. These opportunities cover every field of study and include options for both fully-funded and partially-funded awards.Scholarships offer: Full/Partial tuition waivers, living allowances, health insurance, and visa support. Fully-Funded Scholarships: These cover your tuition fees and provide a monthly stipend.Partially-Funded Scholarships: These cover tuition fees only; you'll need to manage your own living expenses.Application Deadlines: Vary by institution but mostly between Jan-June 2025. Since deadlines vary, please refer to the attached PDF for detailed information and to submit your application promptly.Fields offered: These are offered in 100+ fields/majors.Important Notes:Applications must be submitted directly to the host institution.Some scholarships require service commitments, research publications, or internships.How to Apply?See the database of scholarships in the PDF given belowhttps://lnkd.in/dxhq2Gdd\n              \n\n        \n          …see more",
            "postUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287365911085228032?updateEntityUrn=urn%3Ali%3Afs_updateV2%3A%28urn%3Ali%3Aactivity%3A7287365911085228032%2CFEED_DETAIL%2CEMPTY%2CDEFAULT%2Cfalse%29",
            "imageUrl": "https://media.licdn.com/dms/image/v2/D5605AQH0aoBRN4ccBA/videocover-low/B56ZSHsp.OHoCM-/0/1737443422356?e=1743145200&v=beta&t=ghK-J0hBWKy-kDcCmPHXnVhVw9ZZRWcjVEIUXj3sO6U",
            "platform": "linkedin",
            "processed": true,
            "category": "Educational & Learning",
            "refinedDescription": "Topic: Thailand Government Scholarships 2025\nEntity: Thai Government, Thai Universities\nConcept: Fully-funded and partially-funded scholarships for international students\n\nDescription:\nThe Thai Government is offering scholarships for Bachelor's, Master's, and PhD programs at various universities in Thailand. These scholarships cover over 100 fields of study and provide options for both fully-funded and partially-funded awards.\n\nKey Benefits:\n- Full/Partial tuition waivers\n- Living allowances\n- Health insurance\n- Visa support\n\nScholarship Types:\n- Fully-Funded Scholarships: Cover tuition fees and provide a monthly stipend\n- Partially-Funded Scholarships: Cover tuition fees only, requiring students to manage their own living expenses\n\nImportant Details:\n- Application Deadlines: Vary by institution, primarily between January and June 2025\n- Application Process: Must be submitted directly to the host institution\n- Additional Requirements: Some scholarships may require service commitments, research publications, or internships\n\nHow to Apply:\nRefer to the attached PDF database for detailed information and application submission: https://lnkd.in/dxhq2Gdd\n\nContext: This post aims to inform and guide international students interested in pursuing higher education in Thailand through government-funded scholarships.\n\nThis is optimized for retrieval through natural language queries by highlighting key topics, entities, and concepts, while preserving important details and context. The structured information facilitates semantic search, maintaining the post's original intent and meaning.",
            "createdAt": "2025-03-21 06:15:41.894000",
            "updatedAt": "2025-03-21 06:15:41.894000",
            "__v": 0
        },
        {
            "_id": "67dd040eb42d908e4f62e30d",
            "postTitle": "Waqar Baig",
            "description": "Fully Funded Masters/MPhil, Masters leading to PhD & PhD in World Top Ranked University (31st in the World QS Rankings), SNU, South Korea for Fall 2025 SessionSeoul National University (SNU), ranked 31st in the QS World University Rankings, is offering fully funded admissions for Masters, MPhil, Masters leading to PhD, and PhD programs for the Fall 2025 session.  However, please note that the application window is very short: March 4th – 6th, 2025 (only 3 days), so make sure to prepare in advance now and find your relevant professors there now by reading below.Masters/MPhil, Masters leading to PhD & PhD  in Almost Every Field offered at the UniversityScholarship Opportunities1) Global Korea Scholarship (GKS)- What It Is: A university-level full scholarship that covers tuition, living expenses, and more. As from university side GKS application, you can apply through SNU & SNU will nominate you as their final candidate and will send to GKS headquarters and at the end if GKS selects you, you will study as GKS scholar in SNU. If you win it, you do not need any funding by professor.- How It Works: SNU will soon post the criteria for GKS on its International Admissions notice board. - Tip: Aim for GKS if you have a high CGPA and strong publication records.  Otherwise choose other university in Korea to apply through GKS university applicant. Go for other scholarships/fundings given below for SNU.- What are GKS university applicants: Read here: https://lnkd.in/datxADg42) SNU Scholarshipsa) Graduate Scholarship for Foreign Students (GSFS)- What It Is: A partial scholarship that requires additional funding from a professor.- Updates: Details will soon be available on the SNU notice board and through the International Office.- Links: The details about it will be posted soon on SNU notice board or email SNU international Office hereb) SNU President Fellowship Program (SPF)- What It Is: A full scholarship available only for PhD candidates ( only for faculty members from universities/colleges).- Note: This scholarship is independent of professor funding. If a professor also offers funding, it serves as an extra benefit.- Updates: The details about it will be posted soon on SNU notice board or email SNU international Office here3) Professor Funding/Scholarship- What It Is: Most SNU professors have funding from South Korean or US industries to cover tuition fees and provide a monthly stipend.- How It Works: In every case of the scholarship, university one and professor one,  you have to contact the professor. Even if you do not secure a university scholarship, contacting and impressing a professor with a similar research background can secure full funding for tuition fee and stipend.- Guide: Learn more about contacting supervisors here: read here How to Apply See the link for all details https://lnkd.in/eB4TX-xu\n              \n\n        \n          …see more",
            "postUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7287532717490032640?updateEntityUrn=urn%3Ali%3Afs_updateV2%3A%28urn%3Ali%3Aactivity%3A7287532717490032640%2CFEED_DETAIL%2CEMPTY%2CDEFAULT%2Cfalse%29",
            "imageUrl": "https://media.licdn.com/dms/image/v2/D5622AQFyfQLFZ8EpNw/feedshare-shrink_480/B56ZSKEYddHoAg-/0/1737483194093?e=1745452800&v=beta&t=P87v2XdZ13-wxzc8287IDpQ3X6INPlvP5Q1gwTfs3Iw",
            "platform": "linkedin",
            "processed": true,
            "category": "Educational & Learning",
            "refinedDescription": "Title: Fully Funded Scholarships at Seoul National University (SNU) for Fall 2025\n\nIntroduction:\nSeoul National University (SNU), ranked 31st in the QS World University Rankings, is offering fully funded admissions for Masters, MPhil, Masters leading to PhD, and PhD programs for the Fall 2025 session. The application window is brief, spanning from March 4th to 6th, 2025.\n\nKey Opportunities:\n\n1. Global Korea Scholarship (GKS): A university-level full scholarship covering tuition, living expenses, and more. SNU will nominate candidates, and GKS will make the final selection.\n2. SNU Scholarships:\n\t* Graduate Scholarship for Foreign Students (GSFS): A partial scholarship requiring additional funding from a professor.\n\t* SNU President Fellowship Program (SPF): A full scholarship available only for PhD candidates (faculty members from universities/colleges).\n3. Professor Funding/Scholarship: Most SNU professors have funding from South Korean or US industries to cover tuition fees and provide a monthly stipend. Contacting a professor with a similar research background can secure full funding.\n\nEligibility and Application:\n\n* Programs Offered: Masters, MPhil, Masters leading to PhD, and PhD in almost every field.\n* Application Window: March 4th – 6th, 2025.\n* How to Apply: Visit the link for all details: https://lnkd.in/eB4TX-xu\n* Guide to Contacting Supervisors: Learn more about contacting supervisors here: read here\n\nImportant Notes:\n\n* Aim for GKS if you have a high CGPA and strong publication records.\n* If you don't win GKS, consider other scholarships/fundings or apply through other universities in Korea.\n* Professor funding is available, but you must contact the professor directly.\n\nInstitutions and Rankings:\n\n* Seoul National University (SNU): Ranked 31st in the QS World University Rankings.\n* Global Korea Scholarship (GKS): A university-level full scholarship.\n\nThis highlights key topics, entities, and concepts, while preserving important details and context. It is structured to optimize semantic search and maintains the original intent and meaning of the post.",
            "createdAt": "2025-03-21 06:15:42.042000",
            "updatedAt": "2025-03-21 06:15:42.042000",
            "__v": 0
        },
        {
            "_id": "67dd041260be77dd75c84241",
            "postTitle": "Ethan (Yudian) Zheng",
            "description": "🚀 Attention Tech Interns (AI roles)! 🚀Looking for Machine Learning and AI internships? 🌟 We've just compiled a list of hourly refreshed internship opportunities in these cutting-edge fields! 🧠💻From work models (on-site, hybrid, remote) to hire and graduation times, this list has unique details to help you land the right opportunity. With AI shaping the future, now’s the time to make your mark. 💥👉 Drop your email in the comments or DM me, and I’ll send the list your way. Let’s take the first step towards a future in AI together! 💪#MachineLearning #AI #Internships #TechJobs #CareerGrowth #AIinternships\n              \n\n        \n          …see more",
            "postUrl": "https://www.linkedin.com/feed/update/urn:li:activity:7238816158026506240?updateEntityUrn=urn%3Ali%3Afs_updateV2%3A%28urn%3Ali%3Aactivity%3A7238816158026506240%2CFEED_DETAIL%2CEMPTY%2CDEFAULT%2Cfalse%29",
            "imageUrl": "https://media.licdn.com/dms/image/v2/D5622AQE2-c3hwpeYKA/feedshare-shrink_480/feedshare-shrink_480/0/1725850018322?e=1745452800&v=beta&t=XZ2oceqo-MlBT8mnPrfaeXvFmIMTHROPbVGZq3G4YW0",
            "platform": "linkedin",
            "processed": true,
            "category": "Educational & Learning",
            "refinedDescription": "Post Title: Ethan (Yudian) Zheng - Machine Learning and AI Internship Opportunities\n\nKey Topics: Machine Learning, Artificial Intelligence (AI), Internships, Tech Jobs, Career Growth\n\nDescription: Looking for internship opportunities in Machine Learning and AI? A newly compiled list of hourly refreshed internships in these cutting-edge fields is available. The list includes unique details such as work models (on-site, hybrid, remote), hire and graduation times, to help individuals land the right opportunity. Interested individuals can request the list by dropping their email in the comments or sending a direct message.\n\n Entities Mentioned: Ethan (Yudian) Zheng\n\nConcepts: Career Development, Job Search, Technology, AI Career\n\nCall to Action: Drop your email in the comments or send a direct message to receive the list of internship opportunities.\n\nContext: The post aims to provide valuable information and resources to individuals interested in pursuing a career in Machine Learning and AI, specifically interns looking for job opportunities in these fields.\n\nSemantic Search Keywords: Machine Learning internships, AI internships, tech jobs, career growth, internship opportunities, artificial intelligence careers, technology internships.\n\nThis highlights the key topics, entities, and concepts present in the post, while preserving the important details and context. The structure is optimized for semantic search, making it easier for users to find the post when searching using natural language queries. The original intent and meaning of the post are maintained, with a clear call to action for interested individuals.",
            "createdAt": "2025-03-21 06:15:46.251000",
            "updatedAt": "2025-03-21 06:15:46.251000",
            "__v": 0
        }
    ],
    "topk": 5,
    "user_id": "67daafcdba1148b12347fe61",
    "user_query": "show me the posts related to scholarships",
    "embedding_model": "BAAI/bge-small-en-v1.5",
    "embedding_dimension": 384,
    "db_handler": "<db.QdrantDB object at 0x0000022ED447B6B0>",
    "collection_name": "my_collection"
}